TexasInstruments/mspm0-sdk/examples/nortos/LP_MSPM0C1104/msp_subsystems/watchdog/ti_msp_dl_config.h
/*
 * Copyright (c) 2023, Texas Instruments Incorporated - http://www.ti.com
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

/*
 *  ============ ti_msp_dl_config.h =============
 *  Configured MSPM0 DriverLib module declarations
 *
 *  DO NOT EDIT - This file is generated for the LP_MSPM0C1104
 *  by the SysConfig tool.
 */
#ifndef ti_msp_dl_config_h
#define ti_msp_dl_config_h

#define CONFIG_LP_MSPM0C1104
#define CONFIG_MSPM0C1104

#if defined(__ti_version__) || defined(__TI_COMPILER_VERSION__)
#define SYSCONFIG_WEAK __attribute__((weak))
#elif defined(__IAR_SYSTEMS_ICC__)
#define SYSCONFIG_WEAK __weak
#elif defined(__GNUC__)
#define SYSCONFIG_WEAK __attribute__((weak))
#endif

#include <ti/devices/msp/msp.h>
#include <ti/driverlib/driverlib.h>
#include <ti/driverlib/m0p/dl_core.h>

#ifdef __cplusplus
extern "C" {
#endif

/*
 *  ======== SYSCFG_DL_init ========
 *  Perform all required MSP DL initialization
 *
 *  This function should be called once at a point before any use of
 *  MSP DL.
 */


/* clang-format off */

#define POWER_STARTUP_DELAY                                                (16)


#define CPUCLK_FREQ                                                     24000000



/* Defines for watchdog_timer */
#define watchdog_timer_INST                                              (TIMA0)
#define watchdog_timer_INST_IRQHandler                          TIMA0_IRQHandler
#define watchdog_timer_INST_INT_IRQN                            (TIMA0_INT_IRQn)
#define watchdog_timer_INST_LOAD_VALUE                                  (32767U)




/* Port definition for Pin Group WDT */
#define WDT_PORT                                                         (GPIOA)

/* Defines for WDI: GPIOA.24 with pinCMx 25 on package pin 19 */
// pins affected by this interrupt request:["WDI","Start"]
#define WDT_INT_IRQN                                            (GPIOA_INT_IRQn)
#define WDT_INT_IIDX                            (DL_INTERRUPT_GROUP1_IIDX_GPIOA)
#define WDT_WDI_IIDX                                        (DL_GPIO_IIDX_DIO24)
#define WDT_WDI_PIN                                             (DL_GPIO_PIN_24)
#define WDT_WDI_IOMUX                                            (IOMUX_PINCM25)
/* Defines for Start: GPIOA.27 with pinCMx 28 on package pin 2 */
#define WDT_Start_IIDX                                      (DL_GPIO_IIDX_DIO27)
#define WDT_Start_PIN                                           (DL_GPIO_PIN_27)
#define WDT_Start_IOMUX                                          (IOMUX_PINCM28)
/* Defines for WDO: GPIOA.0 with pinCMx 1 on package pin 4 */
#define WDT_WDO_PIN                                              (DL_GPIO_PIN_0)
#define WDT_WDO_IOMUX                                             (IOMUX_PINCM1)


/* clang-format on */

void SYSCFG_DL_init(void);
void SYSCFG_DL_initPower(void);
void SYSCFG_DL_GPIO_init(void);
void SYSCFG_DL_SYSCTL_init(void);
void SYSCFG_DL_watchdog_timer_init(void);



#ifdef __cplusplus
}
#endif

#endif /* ti_msp_dl_config_h */
